[
  {
    "path": "posts/DataViz2/",
    "title": "DataViz Makeover 2",
    "description": "DataViz Makeover 2 for ISSS608: Visual Analytics",
    "author": [],
    "date": "2021-06-19",
    "categories": [],
    "contents": "\r\n1 Critique of Original Visualization\r\nThe original visualization is shown below.\r\n\r\n1.1 Clarity\r\nThe graph has no title to show what this graph is mainly represent.\r\nThere is no legend or timeline indicates which period of data this graph shows.\r\nFor the tooptip of each bubble, it does not indicate the value on it represents imports or exports or total value or something else.\r\nThe text in the blue box compares the trade value of Singapore with Mainland China since 2009 and United States since 2006, so it actually compares the trade value of these two countries in a long dynamic period. However, this graph is a static graph, it can not reflect the change across a period.\r\n1.2 Aesthetic\r\nBecause those bubbles are not transparent, when two or more bubbles overlap, the center point of some bubbles cannot be seen. For example, since the bubble of United States and EU overlap with each other, we cannot really tell the center point of EU falls in which section since it is covered by the bubble of United States.\r\nIn this graph, the size of every bubble represents the total trade value with respect to the country, but for some countries their sizes look pretty similar. For example, the bubble size of Korea, Japan and Indonesia are pretty much the same, so it is difficult to compare which of them has larger trade value.\r\nNo stick mark is used even though the imports and exports are on continuous scale, which makes it difficult to tell the imports and exports of some country. For example, it is not very clear if the exports of Thailand is over 20 billion dollars or not.\r\n2 Makeover Design\r\nThe makeover design is shown below:\r\n\r\n2.1 Clarity\r\nA title is added to indicate that this graph is about Singapore merchandise trade with respect to different month from 2011 to 2020.\r\nA page controller is added so that the graph can show the change of imports and exports in a month or in a period of time. And since animation is added, we can see the change from one month to another month in a slow-motion way, which makes us easier to capture the change.\r\nThe content of the tooltip is well formatted to reflect the imports, exports and total trade value.\r\n2.2 Aesthetic\r\nAll the circles in the graph are transparent and a light color border is added so that even though two circles overlap we can still see their size and border clearly.\r\nConsidering it might be difficult to differentiate the size of two countries with similar value, color is also added to the graph so that we can also compare the value of different circle by their color as well.\r\nA grid is added to the background so that it would be clearer for us to see the rough upper bound and lower bound for each country.\r\n3 Proposed Visualization\r\nThe makeover visualization on Tableau Public is published here.\r\n4 Step-by-step Guide\r\nOpen the downloaded dataset “outputFile.xlsx” in Excel. Remove the text information above and below T1 and T2.\r\n\r\nSave the processed dataset and import it into Tableau, drag T1 to the Data Source panel.\r\n\r\nClick on the small triangle in the upper right corner of column Variables, select “Split”, then the column Variables is automatically split into two separate columns.\r\n\r\nClick on the small triangle in the upper right corner of column Variables, select “Hide” to hide this column. Repeat the same thing for column Varables – Split 2 to hide it as well.\r\n\r\nRename the column Varables – Split 1 as “Country”.\r\n\r\nRetain those months between January 2011 and December 2020 and hide all the other month columns.\r\n\r\nSelect column 2011 Jan, go to the most right side of this table, press “shift” on the keyboard and select column 2020 Dec. Click on the small triangle in the upper right corner of column 2020 Dec, select “Pivot” to pivot these columns to rows.\r\n\r\nRename the column Pivot Field Names as “Month” and the column Pivot Field Values as “Imports”.\r\n\r\nClick on “Abc” in the upper left corner of column Month, select “Date” to change the data type of this column from String to Date.\r\n\r\nClick on “Abc” in the upper left corner of column Imports, select “Number(decimal)” to change the data type of this column from String to Number.\r\n\r\nGo to Worksheet Sheet 1, put Month on Columns, click on the small triangle on the right side and select Day to represent the data according to each day of the year.\r\n\r\nPut Imports on Rows, click on the small triangle on the right side and select Measure, choose “Sum” to represent the imports according to sum of the imports.\r\n\r\nPut Country to Filters panel, select the 10 countries showed on the original visualization and click on OK.\r\n\r\nPut Country on Columns.\r\n\r\nClick on Analysis on the navigation bar, select View Data and choose Export All. Name the processed csv file as “Imports by Region” and then click on Save.\r\n\r\nRepeat the same operations to process the table T2 to a new csv table “Exports by Region”.\r\n\r\nImport the processed dataset Imports by Region and Exports by Region into Tableau.\r\n\r\nClick on the small triangle on the right side of “Imports by Region.csv”, select open to build a join relationship.\r\n\r\nDrag Exports by Region.csv to the join canvas.\r\n\r\nClick the join icon and select the “Add new join clause” dropdown list and then add Day of Month to the join clause.\r\n\r\nRename column Sum of Exports as Exports and column Sum of Imports as Imports.\r\n\r\nClick on the “Abc” on the upper left of the two Day of Month columns and change the data type from String to Date.\r\n\r\nHide one Country column and one Day of Month column.\r\n\r\nRename the column Day of Month as Month.\r\n\r\nBecause in the original dataset, the unit of European Union is Million Dollars while the unit of all the other countries is Thousand Dollars, we need to create a new calculated field to make the value of all these countries in the same unit. Go to Worksheet Sheet 1, click on Analysis on the navigation bar and select “Create Calculated Field”. Create a calculated field called “Imports (Thousand Dollars)” which convert the unit of all countries’ imports to Thousand Dollars.\r\n\r\nRepeat the same things to create a calculated field called “Exports (Thousand Dollars)” which convert the unit of all countries’ exports to Thousand Dollars.\r\n\r\nCreate a calculated field called “Total Trade” which is the summation of imports and exports, then click OK.\r\n\r\nPut Imports (Thousand Dollars) on Rows and Exports (Thousand Dollars) on Columns.\r\n\r\nPut Country on Detail at the Marks panel.\r\n\r\nPut Total Trade on Size at the Marks panel.\r\n\r\nAdjust the size to be a little bit larger to make the difference between different countries clearer.\r\n\r\nChange the type of mark to be Circle at the Marks panel.\r\n\r\nPut Total Trade on Color at the Marks Panel.\r\n\r\nClick Color at the Marks Panel and then click Edit Colours. Change the color schema to Red-Blue Diverging and check the Use Full Colour Range check box, then click OK.\r\n\r\nClick Color at the Marks Panel and then change the opacity from 100% to 80%. Select the Border dropdown list and add a white border to the circle to make the overlap part to be clear to see.\r\n\r\nCreate a calculated field called Rank by Imports to calculate the rank of different countries according to their imports.\r\n\r\nCreate a calculated field called Rank by Exports to calculate the rank of different countries according to their exports.\r\n\r\nPut Month on the Pages panel, click the small little triangle on the right side and select month to represent Month by the month of year.\r\n\r\nPut Rank by Imports and Rank by Exports on Tooltip.\r\n\r\nClick the small triangle on the right side of Rank by Imports and Rank by Exports, go to Compute Using and then select Country.\r\n\r\nClick Tooltip on the Marks panel and format the content of tooltip as shown below.\r\n\r\nPut Country on Lable and check the check box “Allow lables to overlap other marks”.\r\n\r\nRight click on the y-axis and select Add Reference Line. Choose Median for the second dropdown list under Value, select Custom for Lable and format the content of label as Median=Value. Format the reference line as a thin dotted line and change the color to light grey, then click OK.\r\n\r\nRepeat the same things to add a reference line on the x-axis.\r\n\r\nClick Format on the navigation bar and then select Animations, turn on the switch for animation and set Duration as 2.00 seconds.\r\n\r\nRename the sheet name as “Singapore Merchandise Trade by Region” and the final visualization is done.\r\n\r\n5 Derived Insights\r\nWe can see that in the early part of this 10-years period, the top trading country of Singapore was Malaysia. However, in around 2015, the total trading value for China started to exceed Malaysia and both the imports and exports show an increasing trend. Since 2018, the deficit with China became more significant.\r\n\r\nSince 2018, Singapore started to have more merchandise trade with some west countries like US and EU. With the increase of the total trade value at the same time, the exports of these two countries fluctuate around the median while the imports have a rising trend, which shows Singapore is in deficit with these two countries.\r\n\r\nHong Kong is always a net exporter during this 10-years period. The exports with Hong Kong shows an overall growing trend and between 2019 and 2020 the trade surplus growth is more significant.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-06-19T21:32:24+08:00",
    "input_file": "DataViz2.knit.md"
  },
  {
    "path": "posts/DataViz1/",
    "title": "DataViz Makeover 1",
    "description": "DataViz Makeover 1 for ISSS608: Visual Analytics",
    "author": [],
    "date": "2021-05-30",
    "categories": [],
    "contents": "\r\n1 Critique of Original Visualization\r\nThe original visualization is shown below.\r\n\r\n1.1 Clarity\r\nThe title and the y-axis of the graph does not show the unit of the trade value. In the dataset, the trade value has two kinds of units, which is thousand dollars and million dollars. So it might make people confused if we do not specify the unit of the value.\r\nThe label of x-axis is month of period, but in fact the x-axis shows different years not different month.\r\nThe original visualization used area chart which could misleading people to compare the height of import and export in the chart. However, the chart has two different y-axis for import and export and their scale is also different.\r\n1.2 Aesthetic\r\nThe title and the graph are not aligned.\r\nThe width of charts for different regions are not the same.\r\nThe x-axis uses tick marks on categorical scale.\r\nThe color of the area makes the overlapped part of the trend line not very clear to see.\r\nThe two different y-axis for import and export are not differentiated by color.\r\n2 Makeover Design\r\nThe makeover design is shown below:\r\n\r\n2.1 Clarity\r\nThe unit of the trading values is added to the sheet title, which is thousand dollars. And all the numerical data in the dataset is already convert to this unit.\r\nThe x-axis represent month and the label of axis is revised accordingly.\r\nInstead of using area chart, the makeover design used lines to represent the data.\r\nThe average reference lines are added to make it easier to see the scale of the data.\r\nA tooltip is added to highlight the key information at each data point.\r\n2.2 Aesthetic\r\nThe title and the graph are set to be aligned.\r\nThe width of charts for different regions are set to be the same.\r\nThe x-axis removed original tick marks.\r\nThe two different y-axis for import and export are differentiated by using different color.\r\n3 Proposed Visualization\r\nThe makeover visualization on Tableau Public is published here.\r\n4 Step-by-step Guide\r\nRemove the text information above T1 and T2\r\n\r\nRemain data from 2019 to 2021 and delete the rest part of the data\r\n\r\nSelect all the data, click on the yellow exclamation mark and choose Convert to Number to convert the original data from text to number\r\n\r\nMove the top seven statistic rows to other new sheets, remove those rows from original sheet and rename the sheets\r\n\r\nRemain the rows of the top six trading countries and delete the rest of the data. Transpose the table and rename the columns as shown below\r\n\r\nCombine the Import table, Export table and statistic information tables into one big table\r\n\r\nImport the processed data into Tableau\r\n\r\nAdd Import to Rows and Month to Columns\r\n\r\nChange the Marks from Automatic to Line\r\n\r\nAdd Export to Rows near by Import and add Region to Columns\r\n\r\nFit the width for the worksheet and adjust the size of the axis a little bit\r\n\r\nClick on the small triangle on the right of Measure Names, choose Edit Colours and change the color of Import line to red to make it looks clear\r\n\r\nRight click on the Import y-axis, choose Format, select the font dropdown list under Default and change it to red. Repeat the same thing to change the color of Export y-axis to blue\r\n\r\nRight click on the Import y-axis, choose Add Reference Line, remain the Value as Average, change the dropdown list of Label to Custom and format it as Avg and the average value. Change Line to a thin dotted line and change the color of the line to a lighter red. Repeat the same things for Export y-axis.\r\n\r\nSelect SUM(Import) in the Marks panel and click on Tooltip. Format the content of tooltip as shown below and use different font size and color to highlight the key information. Repeat the same things for SUM(Export).\r\n\r\nHide Field Labels for Columns\r\n\r\nRename the sheet title\r\n\r\nSort the Month in a correct order\r\n\r\nChange the sheet name\r\n\r\nCreate a new sheet and rename it Imports of Asia and America\r\n\r\nAdd Asia Imports and America Imports to Rows and add Month to Columns. Change Marks from Automatic to Line\r\n\r\nFit Width and resize the graph a little bit\r\n\r\nChange the color of y-axis according to the color of the lines\r\n\r\nFormat the content of tooltip as following\r\n\r\nHide Field Labels for Columns\r\n\r\nRename the sheet title\r\n\r\nSort the Month in a correct order\r\n\r\nRepeat the same things to create a new sheet for Asia Exports and America Exports\r\n\r\nRepeat the same things to create a new sheet for Total Merchandise Imports and Total Merchandise Exports\r\n\r\nCreate a Dashboard and put the four worksheets created above into it. Set the Size as Automatic\r\n\r\n5 Derived Insights\r\nWe can see that there is a significant decline trend between 2020 March and 2020 May both in Asia and worldwide. For the total merchandise trade, the trade imports decreased around 22% and trade exports decreased around 20%, which changed just within two months. This might due to the breakout of Covid throughout the world. And we can refer to the chart of Mainland China, there is also a dramatic decrease from the end of 2019 to the first quarter of 2020, which may due to that the breakout of Covid in China is earlier than in the other countries.\r\nThe scale of imports and exports of Hong Kong is very different, the imports of Hong Kong between 2019 and 2021 is only around 1M thousand dollars, but the exports reached around 5M thousand dollars, nearly 5 times of imports. This may because Hong Kong is a free-trade port and its trading policy is much different with China Mainland, which makes it easier to do some export trading.\r\nObserving the chart of US, we can see that the exports of US increased rapidly from the end of 2019 to early 2020, compared with 2019 September, the exports increased more than 56%. One reason may be that the government published several policies to increase the exports to China in order to reduce the trading deficit.\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T23:33:31+08:00",
    "input_file": "DataViz1.knit.md"
  },
  {
    "path": "posts/welcome/",
    "title": "ISSS608 Blog",
    "description": "Course blog for ISSS608 Visual Analytics.",
    "author": [
      {
        "name": "Liang Yingfang",
        "url": {}
      }
    ],
    "date": "2021-05-22",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-05-30T22:55:33+08:00",
    "input_file": "welcome.knit.md"
  }
]
